#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_kms_key.encrytion_rest: Refreshing state... [id=d25d563f-9511-4831-9aee-0823f480e665]
aws_vpc.this: Refreshing state... [id=vpc-0aee610d9ee2f5056]
aws_kms_key.encrytion_secret: Refreshing state... [id=49c814dd-0c0f-4e8d-8dc1-4e4b5f688166]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_secretsmanager_secret.elasticache_auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD]
aws_secretsmanager_secret_version.auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD|8928B07B-E518-404C-91FB-015779DEFB0D]
aws_subnet.public[0]: Refreshing state... [id=subnet-01504aaf919b844a2]
aws_default_security_group.default: Refreshing state... [id=sg-017656e5a4e187b27]
aws_route_table.private[2]: Refreshing state... [id=rtb-0be19402a8902cddc]
aws_route_table.private[0]: Refreshing state... [id=rtb-00fd94662b273fa5f]
aws_subnet.private[2]: Refreshing state... [id=subnet-052cb9788e3699e42]
aws_subnet.private[1]: Refreshing state... [id=subnet-00445199ef90108e3]
aws_security_group.elasticache: Refreshing state... [id=sg-0b3ae4cb2306dd175]
aws_route_table.private[1]: Refreshing state... [id=rtb-09c463d4787f20931]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d793fee34548d46b]
aws_route_table.public: Refreshing state... [id=rtb-07a879baced138b59]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049a33ab4984be2a1]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=cache-subnet]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ec28b2c44b0623b5]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07474438f8d7717f5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a3cfb9c7b6d62162]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_replication_group.app4 will be created
  + resource "aws_elasticache_replication_group" "app4" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = true
      + auth_token                     = (sensitive value)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "ElastiCache cluster for app4"
      + engine                         = "redis"
      + engine_version                 = (known after apply)
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + kms_key_id                     = "d25d563f-9511-4831-9aee-0823f480e665"
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + node_type                      = "cache.t2.small"
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = 3
      + parameter_group_name           = "default.redis7.cluster.on"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = 2
      + replication_group_id           = "app4-redis-cluster"
      + security_group_ids             = [
          + "sg-0b3ae4cb2306dd175",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "cache-subnet"
      + tags_all                       = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + transit_encryption_enabled     = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*